cask_args appdir: '/Applications'

brew 'vim', args: ['with-lua']
brew 'zsh'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'ghq'
brew 'peco'
brew 'z'

brew 'git'
brew 'git-secrets'
brew 'hub'
brew 'ghi'

brew 'ruby'
brew 'python'

brew 'ansible'
brew 'terminal-notifier'
brew 'doxygen'

cask 'adobe-acrobat'
cask 'adobe-creative-cloud'
cask 'adobe-photoshop-cc'
cask 'alfred'
cask 'chatwork'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'hyperswitch'
cask 'invisionsync'
cask 'iterm2'
cask 'karabiner'
cask 'sketch'
cask 'skitch'
cask 'spectacle'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'zeplin'

mas '1Password', id: 443987910
mas 'Xcode', id: 497799835 
mas 'TweetDeck', id: 485812721 
mas 'Slack', id: 803453959 
