cask_args appdir: '/Applications'

# tap
tap 'caskroom/cask'
tap 'caskroom/fonts'

# brew
brew 'vim', args: ['with-lua']
brew 'zsh'
brew 'tmux'

brew 'ghq'
brew 'peco'
brew 'fzf'
brew 'z'
brew 'mas'

brew 'the_silver_searcher'
brew 'gawk'
brew 'gnu-tar'

brew 'reattach-to-user-namespace'

brew 'git'
brew 'gist'
brew 'gibo'
brew 'git-secrets'
brew 'hub', args: ['HEAD']
brew 'ghi'
brew 'tig'

brew 'ruby'
brew 'python'
brew 'perl'
brew 'go'
brew 'node'

brew 'rbenv'
brew 'nodebrew'

brew 'sqlite'

brew 'npm'
brew 'carthage'

brew 'awscli'
brew 'ansible'
brew 'terraform'

brew 'imagemagick'
brew 'nativefier'

brew 'tree'
brew 'jq'
brew 'q'
brew 'nkf'
brew 'terminal-notifier'
brew 'w3m'
brew 'elinks'
brew 'wget'
brew 'googler'
brew 'kubectl'

# cask
cask 'adobe-acrobat'
cask 'adobe-creative-cloud'
cask 'adobe-photoshop-cc'
cask 'alfred'
cask 'appcode'
cask 'charles'
cask 'chatwork'
cask 'cmd-eikana'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'google-cloud-sdk'
cask 'hammerspoon'
cask 'hyperswitch'
cask 'invisionsync'
cask 'iterm2'
cask 'karabiner'
cask 'karabiner-elements'
cask 'kindle'
cask 'sketch'
cask 'skitch'
cask 'shady'
cask 'spectacle'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'vivaldi'
cask 'zeplin'
cask 'zoomus'

# font
cask 'font-source-code-pro-for-powerline'

# mas
mas '1Password', id: 443987910
mas 'Xcode', id: 497799835 
mas 'TweetDeck', id: 485812721 
mas 'Slack', id: 803453959 
mas 'DaisyDisk', id: 411643860
mas 'ColorPicker', id: 641027709
mas 'TableTool', id: 1122008420
